{
  "name": "Allen Johnson",
  "titles": [
    "Full Stack Web Developer",
    "Front-End Software Engineer"
  ],
  "summaryItems": [
    "I am a seasoned full stack developer based in Denver, Colorado.",
    "I have strong expertise in front-end technologies, including JavaScript, React, HTML, and CSS.",
    "I am experienced across diverse environments such as Next.js, Node.js, PHP, Java, .NET, and Ruby on Rails.",
    "I built this site using Next.js, React, TypeScript, and MongoDB, and I deploy to Vercel.",
    "I enjoy travel, hiking, photography, electronic music, generative AI, and foreign languages."
  ],
  "aboutIntro": "I'm Allen Johnson. I live in Denver, Colorado, where I build websites.",
  "aboutItems": [
    "I am a seasoned full stack developer with strong expertise in front-end technologies, including JavaScript, React, HTML, and CSS.",
    "I am experienced across diverse environments such as Next.js, Node.js, PHP, Java, .NET, and Ruby on Rails.",
    "I bring a proven track record in performance optimization, e-commerce, and digital strategy, along with a passion for contributing to collaborative teams and delivering impactful, user-centered solutions.",
    "I also enjoy travel, hiking, photography, electronic music, generative AI, and foreign languages."
  ],
  "contactIntro": "Please send me a message if you have any questions about my skills and experience, or if you would like to inquire about hiring me for your project or team.",
  "location": "Denver, Colorado",
  "phone": "412.708.8946",
  "website": "portfolio.webequate.com",
  "resumeLink": "http://portfolio.webequate.com/resume/AllenJohnson-Resume-Long.pdf",
  "socialLinks": [
    {
      "name": "github",
      "handle": "webequate",
      "url": "https://github.com/webequate"
    },
    {
      "name": "linkedin",
      "handle": "allenhjohnson",
      "url": "https://www.linkedin.com/in/allenhjohnson/"
    },
    {
      "name": "twitter",
      "handle": "WebEquate",
      "url": "https://twitter.com/WebEquate"
    }
  ]
}
