[
  {
    "company": "WebEquate",
    "role": "Founder & Full Stack Developer",
    "city": "Denver, CO",
    "startDate": "August 2022",
    "endDate": "Present",
    "achievements": [
      "Built dynamic client websites using Next.js, React, TypeScript, MongoDB, and Tailwind CSS.",
      "Leveraged Next.js and server-side rendering to pre-optimize performance and SEO, while delivering the seamless, interactive user experience of a single-page application.",
      "Delivered custom digital strategies and a comprehensive suite of services—including social media marketing, web analytics, domain management, hosting, copywriting, SEO, creative asset optimization, and content updates—to enhance client presence and drive measurable growth.",
      "Utilized cutting-edge generative AI tools—such as Flux, Stable Diffusion, and custom-trained LoRA models—for image and video creation, producing high-quality, tailored visual content across diverse creative projects."
    ],
    "order": 17
  },
  {
    "company": "Etsy",
    "role": "Software Engineer (Contract)",
    "city": "Brooklyn, NY (Fully remote from Denver, CO)",
    "startDate": "July 2021",
    "endDate": "July 2022",
    "achievements": [
      "Developed software, tools, infrastructure, and documentation empowering product engineers to adopt modern front-end technologies—such as React—within a monolithic PHP environment, while preserving site speed for shoppers and search engines.",
      "Enhanced and supported a framework for interactive, server-rendered React component islands, enabling intercommunication post-hydration via a shared Redux store.",
      "Improved site performance and developer experience by replacing the Underscore library with native JavaScript and TypeScript."
    ],
    "order": 16
  },
  {
    "company": "DISH Network",
    "role": "Front End Software Developer (Contract)",
    "city": "Englewood, CO",
    "startDate": "June 2019",
    "endDate": "March 2020",
    "achievements": [
      "Developed features for OnTech, a Shopify-based e-commerce site integrated with DISH Network's back-end systems, using JavaScript, React, and Redux to support sales of smart home devices and installation services.",
      "Engineered seamless integration between front-end UI components and complex back-end systems via RESTful APIs, collaborating within a cross-functional, full stack Scrum team to deliver both customer-facing and internal tools.",
      "Enhanced the \"Where's My Tech\" Shopify app (Ruby on Rails and JavaScript), leveraging corporate APIs to dynamically display technician locations and routes."
    ],
    "order": 15
  },
  {
    "company": "WebEquate",
    "role": "Founder & Full Stack Developer",
    "city": "Denver, CO",
    "startDate": "March 2018",
    "endDate": "July 2021",
    "achievements": [
      "Developed and maintained RogerHaydenJohnson.com, the official artist website, using PHP, MySQL, and SCSS, and implemented a mobile-first, responsive design to enhance user experience across devices.",
      "Created and executed the Allen's Aliens social media marketing campaign, integrating event-based giveaways, lead-generating business cards, an Instagram profile, Facebook page, and a responsive website to drive audience engagement and brand visibility."
    ],
    "order": 14
  },
  {
    "company": "JackRabbit (formerly Running Specialty Group)",
    "role": "E-Commerce Front End Developer",
    "city": "Denver, CO",
    "startDate": "September 2015",
    "endDate": "February 2018",
    "achievements": [
      "Developed and maintained front-end features within a Magento e-commerce environment, enhancing site usability and performance.",
      "Created responsive landing pages, CMS templates, and UX improvements using HTML, SCSS, Bootstrap, CSS media queries, and custom JavaScript/jQuery.",
      "Collaborated with marketing partners to integrate paid advertising platforms, implement third-party tracking pixels, and configure dynamic product feeds to optimize campaigns and improve conversion tracking."
    ],
    "order": 13
  },
  {
    "company": "Gates Corporation",
    "role": "Lead Front End Developer (Contract)",
    "city": "Denver, CO",
    "startDate": "January 2015",
    "endDate": "March 2015",
    "achievements": [
      "Led the design and front-end development of a C# .NET web application for equipment tracking, initiating AngularJS implementation optimized for both tablet and desktop use."
    ],
    "order": 12
  },
  {
    "company": "Oppenheimer Funds",
    "role": "Front End Developer (Contract)",
    "city": "Centennial, CO",
    "startDate": "May 2014",
    "endDate": "November 2014",
    "achievements": [
      "Served as a front-end specialist on an Agile team, developing with AngularJS and Ruby on Rails for the company's financial advisor platform."
    ],
    "order": 11
  },
  {
    "company": "Commerce Kitchen",
    "role": "Senior Web Engineer",
    "city": "Denver, CO",
    "startDate": "May 2013",
    "endDate": "November 2013",
    "achievements": [
      "Developed and customized Magento e-commerce stores and served as ScrumMaster for two small Agile teams.",
      "Contributed to internal Ruby on Rails projects to expand technical capabilities."
    ],
    "order": 10
  },
  {
    "company": "Experian",
    "role": "Web Developer (Contract)",
    "city": "Denver, CO",
    "startDate": "December 2012",
    "endDate": "May 2013",
    "achievements": [
      "Contributed front-end development for Experian's UK credit monitoring and identity protection websites."
    ],
    "order": 9
  },
  {
    "company": "Intela",
    "role": "UI Developer / ScrumMaster",
    "city": "Boulder, CO",
    "startDate": "March 2010",
    "endDate": "December 2012",
    "achievements": [
      "Led a 7-member UI team as both Lead Developer and ScrumMaster, delivering high-performing online properties that generated qualified leads for advertisers across 9 international markets.",
      "Developed responsive landing pages from Photoshop designs and created a reusable JavaScript/jQuery library to integrate a new RESTful API for lead validation using internal and third-party services.",
      "Facilitated Agile ceremonies, including daily stand-ups, bi-weekly retrospectives, and coordinated twice-weekly code releases while collaborating closely with product owners, project managers, and back-end teams."
    ],
    "order": 8
  },
  {
    "company": "Numeric Analytics",
    "role": "Independent Contractor",
    "city": "Golden, CO",
    "startDate": "December 2009",
    "endDate": "March 2010",
    "achievements": [
      "Implemented custom web analytics and tracking solutions using a vanilla JavaScript framework integrated with Omniture for client companies."
    ],
    "order": 7
  },
  {
    "company": "Highmark",
    "role": "Web Developer (Contract)",
    "city": "Pittsburgh, PA",
    "startDate": "May 2009",
    "endDate": "December 2009",
    "achievements": [
      "Updated health insurance websites to meet Section 508 accessibility standards by refactoring HTML, CSS, and JavaScript for improved separation of content, presentation, and behavior."
    ],
    "order": 6
  },
  {
    "company": "Fireman Creative",
    "role": "Senior Web Developer",
    "city": "Pittsburgh, PA",
    "startDate": "July 2007",
    "endDate": "May 2009",
    "achievements": [
      "Developed and maintained dynamic, database-driven client websites using PHP and MySQL.",
      "Managed SEO, PPC campaigns (AdWords), user tracking (Google Analytics), and affiliate marketing through LinkShare to drive client visibility and engagement.",
      "Implemented social networking and viral marketing strategies for a regional tourism office, integrating Facebook, Twitter, YouTube, Flickr, and WordPress."
    ],
    "order": 5
  },
  {
    "company": "RJ Lee Group",
    "role": "Software Engineer",
    "city": "Pittsburgh, PA",
    "startDate": "August 2006",
    "endDate": "July 2007",
    "achievements": [
      "Developed laboratory management software to streamline lab operations and data management, using Java, Visual Basic .NET, C#, and ActionScript.",
      "Maintained and updated the corporate website with PHP, HTML, CSS, Flash, and Photoshop."
    ],
    "order": 4
  },
  {
    "company": "WebEquate",
    "role": "Founder & Web Developer",
    "city": "Pittsburgh, PA",
    "startDate": "July 2004",
    "endDate": "August 2006",
    "achievements": [
      "Designed and developed dynamic, database-driven client websites using PHP, MySQL, HTML, and CSS, while managing client relationships and project delivery."
    ],
    "order": 3
  },
  {
    "company": "The Titan Corporation",
    "role": "Scientific Programmer",
    "city": "San Diego, CA",
    "startDate": "August 2002",
    "endDate": "June 2004",
    "achievements": [
      "Developed software tools for modeling and analysis of nuclear and natural radiation systems using Java and JSP to support scientific research and simulations."
    ],
    "order": 2
  },
  {
    "company": "Carnegie Learning",
    "role": "Software Developer",
    "city": "Pittsburgh, PA",
    "startDate": "July 2000",
    "endDate": "October 2001",
    "achievements": [
      "Designed and implemented intelligent cognitive tutoring software using Java and Lisp to enhance personalized learning experiences."
    ],
    "order": 1
  }
]
